src/DataProcessors/ПолучитьСписокИнформационныхБазС_Сервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>ПолучитьСписокИнформационныхБазС_Сервера</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/док_СУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>док_СУБД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Серверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.док_Разрядность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_ВерсииПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СУБД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.док_ТипБД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольЗашифрован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ПолучитьСписокИнформационныхБазС_Сервера/Forms/Форма1/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьСписокБаз(Команда)
	ПолучитьСписокБазНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокБазНаСервере()
	БД.Очистить();
	
	Соединитель = Новый COMObject("V83.COMConnector");	
	 
	СтрокаСоединения = "TCP://" + АдресСервера + ":" + Порт;
	Попытка	
		СоединениеСАгентом = Соединитель.ConnectAgent(СтрокаСоединения);
	Исключение
		Сообщить("Ошибка " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	МассивКластеров = СоединениеСАгентом.GetClusters();
	
	// получается первый массив кластера.
	ОписаниеКластера = МассивКластеров.GetValue(МассивКластеров.GetLowerBound());
	
	// в случае если определены администраторы кластера, должны быть указаны данные о логине.
	СоединениеСАгентом.authenticate(ОписаниеКластера, " ", " ");
	
	МассивБаз = СоединениеСАгентом.GetInfoBases(ОписаниеКластера);
	МаксимальныйИндекс = МассивБаз.GetUpperBound();
	
	Для ТекущийИндекс = МассивБаз.GetLowerBound() По МаксимальныйИндекс Цикл
		ОписаниеБазы = МассивБаз.GetValue(ТекущийИндекс);
		Стр = БД.Добавить();
		Стр.ИБ = ОписаниеБазы.Name;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Порт = "1540";
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СУБД_.Наименование КАК СерверСУБД,
	|	СУБД_.Сервер.IP.(
	|		IP КАК СерверIP
	|	) КАК СерверIP
	|ИЗ
	|	Справочник.док_СУБД КАК СУБД_");
	Таб = Запрос.Выполнить().Выгрузить();
	Для каждого стр из Таб Цикл
		Для каждого стрIP из стр.СерверIP Цикл
			Элементы.АдресСервера.СписокВыбора.Добавить(стрIP.СерверIP,стр.СерверСУБД + " (" + стрIP.СерверIP + ")");
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюНаСервере()
	Для каждого стрБД из БД Цикл
		Для каждого стрУД из УчетныеДанные Цикл
			Попытка
				Подкл = Новый COMОбъект("V83.COMConnector");
				COMОбъект = Подкл.Connect("Srvr=""" + АдресСервера + """;Ref=""" + стрБД.ИБ + """;Usr=""" + стрУД.Логин + """;Pwd=""" + стрУД.Пароль + """");
				Прервать;
			Исключение
				Сообщить(ОписаниеОшибки());
				Продолжить;
				//Возврат;
			КонецПопытки;  
		КонецЦикла;
		Попытка
			стрБД.ПодробнаяИнформация = Строка(COMОбъект.Метаданные.BriefInformation);
			стрБД.Версия = Строка(COMОбъект.Метаданные.Version);
		Исключение
			Сообщить(ОписаниеОшибки());
			Продолжить;	
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформацию(Команда)
	ЗаполнитьИнформациюНаСервере();
КонецПроцедуры
